package Other;


/**
 * дан двумерный массив (или матрица). Который представляет из себя карту морей и островов если смотреть сверху.
 * Островом считается "1" и все прилегающие к ней территории относятся к острову если они тоже "1"/ Кроме тех что по диагонали.
 * "0" это вода.
 * Нужно посчитать сколько всего на карте островов.
 */


public class CountIlandYoutube {
    /*
Вариант 1
 */
    char[][] mapOne ={
            {'1','0','0','0','0','0',},
            {'0','0','0','0','0','0',},



    };


}
